Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/faq.tmx
Source language: en
Languages: fr

source: Design and History FAQ
fr: FAQ Histoire et Design

source: Why does Python use indentation for grouping of statements?
fr: Pourquoi Python utilise l'indentation pour grouper les instructions ?

source: Guido van Rossum believes that using indentation for grouping is extremely elegant and contributes a lot to the clarity of the average Python program. Most people learn to love this feature after a while.
fr: Guido van Rossum pense que l'usage de l'indentation pour regrouper les blocs d'instruction est élégant et contribue énormément à la clareté globale du programme Python. La plupart des gens finissent par aimer cette particularité au bout d'un moment.

source: Since there are no begin/end brackets there cannot be a disagreement between grouping perceived by the parser and the human reader. Occasionally C programmers will encounter a fragment of code like this::
fr: Comme il n'y a pas d'accolades de début/fin, il ne peut y avoir de différence entre le bloc perçu par l'analyseur syntaxique et le lecteur humain. Parfois les programmeurs C pourront trouver un morceau de code comme celui-ci::

source: Only the ``x++`` statement is executed if the condition is true, but the indentation leads you to believe otherwise. Even experienced C programmers will sometimes stare at it a long time wondering why ``y`` is being decremented even for ``x > y``.
fr: Seule l'instruction ``x++`` sera exécutée si la condition est vraie, mais l'indentation pourrait vous faire penser le contraire. Mêmes des développeurs C expérimentés resteront pendant un moment à se demander pourquoi ``y`` est décrémenté même si ``x > y``.

source: Because there are no begin/end brackets, Python is much less prone to coding-style conflicts. In C there are many different ways to place the braces. If you're used to reading and writing code that uses one style, you will feel at least slightly uneasy when reading (or being required to write) another style.
fr: Comme il n'y a pas d'accolades de début/fin, Python est moins sujet aux conflits de style de code. En C, on peut placer les accolades de nombreuses façons. Si vous êtes habitués à lire et écrire selon un style particulier, vous pourriez vous sentir perturbé en lisant (ou en devant écrire) avec un autre style.

source: Many coding styles place begin/end brackets on a line by themself. This makes programs considerably longer and wastes valuable screen space, making it harder to get a good overview of a program. Ideally, a function should fit on one screen (say, 20-30 lines). 20 lines of Python can do a lot more work than 20 lines of C. This is not solely due to the lack of begin/end brackets -- the lack of declarations and the high-level data types are also responsible -- but the indentation-based syntax certainly helps.
fr: Nombre de styles de programmation placent les accolades de début/fin sur une ligne à part. Cela rend les sources beaucoup plus longues et fait perdre une bonne partie de l'espace visible sur l'écran, rendant plus compliqué un aperçu global du programme. Idéalement, une fonction doit être visible sur un même écran (environ 20 ou 30 lignes). 20 lignes de Python peuvent faire beaucoup plus que 20 lignes de C. Ce n'est pas seulement dû à l'absence d'accolades de début/fin -- l'absence de déclarations et les types de haut-niveau en sont également responsables -- mais la syntaxe basée sur l'indentation y est pour beaucoup.

source: Why am I getting strange results with simple arithmetic operations?
fr: Pourquoi ai-je d'étranges résultats suite à de simples opérations arithmétiques ?

source: See the next question.
fr: Voir la question suivante.

source: Why are floating point calculations so inaccurate?
fr: Pourquoi les calculs à virgules flottantes sont si imprécis ?

source: People are often very surprised by results like this::
fr: Les gens sont très souvent surpris par des résultats comme celui-ci ::

source: and think it is a bug in Python. It's not. This has nothing to do with Python, but with how the underlying C platform handles floating point numbers, and ultimately with the inaccuracies introduced when writing down numbers as a string of a fixed number of digits.
fr: et pensent que c'est un bogue dans Python. Ça ne l'est pas. Ceci n'a rien à voir avec Python, mais avec la manière dont la plateforme C sous-jacente gère les nombres à virgule flottante et enfin, les imprécisions introduites lors de l'écriture des nombres en chaînes de caractères d'un nombre fixe de chiffres.

source: The internal representation of floating point numbers uses a fixed number of binary digits to represent a decimal number. Some decimal numbers can't be represented exactly in binary, resulting in small roundoff errors.
fr: La représentation interne des nombres à virgule flottante utilise un nombre fixe de chiffres binaires pour représenter un nombre décimal. Certains nombres décimaux ne peuvent être représentés exactement en binaire, résultant ainsi à de petites erreurs d'arrondi.

source: In decimal math, there are many numbers that can't be represented with a fixed number of decimal digits, e.g. 1/3 = 0.3333333333.......
fr: En mathématiques, beaucoup de nombre ne peuvent être représentés par un nombre fixe de chiffres, par exemple 1/3 = 0.3333333333.......

source: In base 2, 1/2 = 0.1, 1/4 = 0.01, 1/8 = 0.001, etc. .2 equals 2/10 equals 1/5, resulting in the binary fractional number 0.001100110011001...
fr: En base 2, 1/2 = 0.1, 1/4 = 0.01, 1/8 = 0.001, etc. .2 est égale à 2/10 qui est égale à 1/5, ayant pour résultat le nombre fractionnel binaire 0.001100110011001...

source: Floating point numbers only have 32 or 64 bits of precision, so the digits are cut off at some point, and the resulting number is 0.199999999999999996 in decimal, not 0.2.
fr: Les nombres à virgule flottante ont une précision de seulement 32 ou 64 bits, donc les chiffres finissent par être tronqués, et le nombre résultant est 0.199999999999999996 en décimal, pas 0.2.

source: A floating point number's ``repr()`` function prints as many digits are necessary to make ``eval(repr(f)) == f`` true for any float f. The ``str()`` function prints fewer digits and this often results in the more sensible number that was probably intended::
fr: La fonction ``repr()`` d'un nombre décimal affiche autant de chiffres que nécessaire pour rendre l'expression ``eval(repr(f)) == f`` vraie pour tout nombre décimal f. La fonction ``str()`` affiche moins de chiffres et correspond généralement plus au nombre attendu ::

source: One of the consequences of this is that it is error-prone to compare the result of some computation to a float with ``==``. Tiny inaccuracies may mean that ``==`` fails. Instead, you have to check that the difference between the two numbers is less than a certain threshold::
fr: En conséquence comparer le résultat d'un calcul avec un nombre flottant avec l'opérateur '==' est propice à l'obtention d'erreurs. D'infimes imprécisions peuvent faire qu'un test d'égalité avec "==" échoue. Au lieu de cela, vous devez vérifier que la différence entre les deux chiffres est inférieure à un certain seuil ::

source: Please see the chapter on :ref:`floating point arithmetic <tut-fp-issues>` in the Python tutorial for more information.
fr: Veuillez vous référer au chapitre sur :ref:`floating point arithmetic <tut-fp-issues>` du tutoriel python pour de plus amples informations.

source: Why are Python strings immutable?
fr: Pourquoi les chaînes de caractères Python sont-elles immuable ?

source: There are several advantages.
fr: Il y a plusieurs avantages.

source: One is performance: knowing that a string is immutable means we can allocate space for it at creation time, and the storage requirements are fixed and unchanging. This is also one of the reasons for the distinction between tuples and lists.
fr: La première concerne la performance : savoir qu'une chaîne de caractères est immuable signifie que l'allocation mémoire allouée lors de la création de cette chaîne est fixe et figé. C'est aussi l'une des raisons pour lesquelles on fait la distinction entre les tuples et les listes.

source: Another advantage is that strings in Python are considered as "elemental" as numbers. No amount of activity will change the value 8 to anything else, and in Python, no amount of activity will change the string "eight" to anything else.
fr: Un autre avantage est que les chaînes en Python sont considérées aussi "élémentaires" que les nombres. Aucun processus ne changera la valeur du nombre 8 en autre chose, et en Python, aucun processus changera la chaîne de caractère "huit" en autre chose.

source: Why must 'self' be used explicitly in method definitions and calls?
fr: Pourquoi "self" doit-il être explicitement utilisé dans les définitions et les appels de méthode ?

source: The idea was borrowed from Modula-3. It turns out to be very useful, for a variety of reasons.
fr: L'idée a été empruntée à Modula-3. Il s'avère être très utile, pour diverses raisons.

source: First, it's more obvious that you are using a method or instance attribute instead of a local variable. Reading ``self.x`` or ``self.meth()`` makes it absolutely clear that an instance variable or method is used even if you don't know the class definition by heart. In C++, you can sort of tell by the lack of a local variable declaration (assuming globals are rare or easily recognizable) -- but in Python, there are no local variable declarations, so you'd have to look up the class definition to be sure. Some C++ and Java coding standards call for instance attributes to have an ``m_`` prefix, so this explicitness is still useful in those languages, too.
fr: Tout d'abord, il est plus évident d'utiliser une méthode ou un attribut d'instance par exemple au lieu d'une variable locale. Lire ``self.x`` ou ``self.meth()`` est sans ambiguité sur le fait que c'est une variable d'instance ou une méthode qui est utilisée, même si vous ne connaissez pas la définition de classe par cœur. En C++, vous pouvez les reconnaitre par l'absence d'une déclaration de variable locale (en supposant que les variables globales sont rares ou facilement reconnaissables) - mais en Python, il n'y a pas de déclarations de variables locales, de sorte que vous devez chercher la définition de classe pour être sûr. Certaines normes de codages C++ et Java préfixent les attributs d'instance par ``m_``. Cette syntaxe explicite est ainsi utile également pour ces langages.

source: Second, it means that no special syntax is necessary if you want to explicitly reference or call the method from a particular class. In C++, if you want to use a method from a base class which is overridden in a derived class, you have to use the ``::`` operator -- in Python you can write ``baseclass.methodname(self, <argument list>)``. This is particularly useful for :meth:`__init__` methods, and in general in cases where a derived class method wants to extend the base class method of the same name and thus has to call the base class method somehow.
fr: Ensuite, ça veut dire qu'aucune syntaxe spéciale n'est nécessaire si vous souhaitez explicitement référencer ou appeler la méthode depuis une classe en particulier. En C++, si vous utilisez la méthode d'une classe de base elle-même surchargée par une classe dérivée, vous devez utiliser l'opérateur ``::`` -- en Python vous pouvez écrire ``baseclass.methodname(self, <argument list>)``. C'est particulièrement utile pour les méthodes :meth:`__init__`, et de manière générale dans les cas où une classe dérivée veut étendre la méthode du même nom de la classe de base, devant ainsi appeler la méthode de la classe de base d'une certaine manière.

source: Finally, for instance variables it solves a syntactic problem with assignment: since local variables in Python are (by definition!) those variables to which a value is assigned in a function body (and that aren't explicitly declared global), there has to be some way to tell the interpreter that an assignment was meant to assign to an instance variable instead of to a local variable, and it should preferably be syntactic (for efficiency reasons). C++ does this through declarations, but Python doesn't have declarations and it would be a pity having to introduce them just for this purpose. Using the explicit ``self.var`` solves this nicely. Similarly, for using instance variables, having to write ``self.var`` means that references to unqualified names inside a method don't have to search the instance's directories. To put it another way, local variables and instance variables live in two different namespaces, and you need to tell Python which namespace to use.
fr: Enfin, pour des variables d'instance, ça résout un problème syntactique pour l'assignation : puisque les variables locales en Python sont (par définition !) ces variables auxquelles les valeurs sont assignées dans le corps d'une fonction (et n'étant pas déclarées explicitement globales), il doit y avoir un moyen de dire à l'interpréteur qu'une assignation est censée assigner une variable d'instance plutôt qu'une variable locale, et doit de préférence être syntactique (pour des raisons d'efficacité). C++ fait ça au travers de déclarations, mais Python n'a pas de déclarations et ça serait dommage d'avoir à les introduire juste pour cette raison. Utiliser explicitement ``self.var`` résout ça avec élégance. Pareillement, pour utiliser des variables d'instance, avoir à écrire ``self.var`` signifie que les références vers des noms non-qualifiés au sein d'une méthode n'ont pas à être cherchés dans l'annuaire d'instances. En d'autres termes, les variables locales et les variables d'instance vivent dans deux différents espaces de noms, et vous devez dire à Python quel espace de noms utiliser.

source: Why can't I use an assignment in an expression?
fr: Pourquoi ne puis-je pas utiliser d'assignation dans une expression ?

source: Many people used to C or Perl complain that they want to use this C idiom:
fr: De nombreuses personnes habituées à C ou Perl se plaignent de vouloir utiliser cet idiome C :

source: while (line = readline(f)) { // do something with line }
fr: while (line = readline(f)) { // faire quelque chose avec line }

source: where in Python you're forced to write this::
fr: où en Python vous êtes forcé à écrire ceci ::

source: while True: line = f.readline() if not line: break ... # do something with line
fr: while True: line = f.readline() if not line: break ... # faire quelque chose avec line

source: The reason for not allowing assignment in Python expressions is a common, hard-to-find bug in those other languages, caused by this construct:
fr: La raison pour ne pas autoriser l'assignation dans les expressions en Python est un bug fréquent, et difficile à trouver dans ces autres langages, causé par cette construction :

source: if (x = 0) { // error handling } else { // code that only works for nonzero x }
fr: if (x = 0) { // prise en charge de l'erreur } else { // code qui ne fonctionne que quand x est non-zéro }

source: The error is a simple typo: ``x = 0``, which assigns 0 to the variable ``x``, was written while the comparison ``x == 0`` is certainly what was intended.
fr: Cette erreur est une simple coquille : ``x = 0``, qui assigne 0 à la variable ``x``, a été écrit alors que la comparaison ``x == 0`` est certainement ce qui était souhaité.

source: Many alternatives have been proposed. Most are hacks that save some typing but use arbitrary or cryptic syntax or keywords, and fail the simple criterion for language change proposals: it should intuitively suggest the proper meaning to a human reader who has not yet been introduced to the construct.
fr: De nombreuses alternatives ont été proposées. La plupart des hacks économisaient de la frappe mais utilisaient d'arbitraires ou cryptiques syntaxes ou mot-clés et faillait le simple critère pour proposition de changement du langage : ça doit intuitivement suggérer la bonne signification au lecteur qui n'a pas encore été introduit à la construction.

source: An interesting phenomenon is that most experienced Python programmers recognize the ``while True`` idiom and don't seem to be missing the assignment in expression construct much; it's only newcomers who express a strong desire to add this to the language.
fr: Un phénomène intéressant est que la plupart des programmeurs Python expérimentés reconnaissent l'idiome ``while True`` et ne semblent pas manquer l'assignation dans la construction de l'expression; seuls les nouveaux-venus expriment un fort désir d'ajouter ceci au langage.

source: There's an alternative way of spelling this that seems attractive but is generally less robust than the "while True" solution::
fr: Il y a une manière alternative de faire ça qui semble attrayante mais elle est généralement moins robuste que la solution ``while True`` ::

source: line = f.readline() while line: ... # do something with line... line = f.readline()
fr: line = f.readline() while line: ... # faire quelque chose avec line... line = f.readline()

source: The problem with this is that if you change your mind about exactly how you get the next line (e.g. you want to change it into ``sys.stdin.readline()``) you have to remember to change two places in your program -- the second occurrence is hidden at the bottom of the loop.
fr: Le problème avec ceci est que si vous changez d'avis sur la manière dont vous allez récupérer la prochaine ligne (ex : vous voulez changer en ``sys.stdin.readline()``) vous devez vous souvenir de le changer à deux endroits dans votre programme -- la deuxième occurrence est cachée en bas de la boucle.

source: The best approach is to use iterators, making it possible to loop through objects using the ``for`` statement. For example, in the current version of Python file objects support the iterator protocol, so you can now write simply::
fr: La meilleur approche est d'utiliser les itérateurs, rendant possible de boucler au travers d'objets en utilisant la déclaration ``for``. Par exemple, dans la version actuelle de Python, les fichiers objets supportent le protocole d'itérateur, vous pouvez alors simplement écrire ::

source: for line in f: ... # do something with line...
fr: for line in f: ... # faire quelque chose avec line...

source: Why does Python use methods for some functionality (e.g. list.index()) but functions for other (e.g. len(list))?
fr: Pourquoi Python utilise des méthodes pour certaines fonctionnalités (ex : list.index()) mais des fonctions pour d'autres (ex : len(list)) ?

source: The major reason is history. Functions were used for those operations that were generic for a group of types and which were intended to work even for objects that didn't have methods at all (e.g. tuples). It is also convenient to have a function that can readily be applied to an amorphous collection of objects when you use the functional features of Python (``map()``, ``apply()`` et al).
fr: La raison principale est historique. Les fonctions étaient utilisées pour ces opérations qui étaient génériques pour un groupe de types et qui étaient censés fonctionner même pour les objets qui n'avaient pas de méthodes du tout (ex : tuples). C'est aussi pratique d'avoir une fonction qui s'apprête bien à une collection amorphe d'objets lorsque vous utiliser les fonctionnalités fonctionnelles de Python (``map()``, ``apply()`` et autres).

source: In fact, implementing ``len()``, ``max()``, ``min()`` as a built-in function is actually less code than implementing them as methods for each type. One can quibble about individual cases but it's a part of Python, and it's too late to make such fundamental changes now. The functions have to remain to avoid massive code breakage.
fr: En fait, implémenter ``len()``, ``max()``, ``min()`` en tant que fonction intégrée produit moins de code que de les implémenter en tant que méthode pour chaque type. Certains peuvent rouspéter pour des cas individuels mais ça fait partie de Python et il est trop tard pour faire des changements si fondamentaux maintenant. Ces fonctions doivent rester pour éviter la casse massive de code.

source: For string operations, Python has moved from external functions (the ``string`` module) to methods. However, ``len()`` is still a function.
fr: Pour les opérations de chaînes, Python a déplacé les fonctions externes (le module ``string``) vers des méthodes. Cependant, ``len()`` est toujours une fonction.

source: Why is join() a string method instead of a list or tuple method?
fr: Pourquoi join() est une méthode de chaîne plutôt qu'une de liste ou de tuple ?

source: Strings became much more like other standard types starting in Python 1.6, when methods were added which give the same functionality that has always been available using the functions of the string module. Most of these new methods have been widely accepted, but the one which appears to make some programmers feel uncomfortable is::
fr: Les chaînes sont devenues bien plus comme d'autres types standards à partir de Python 1.6, lorsque les méthodes ont été ajoutées fournissant ainsi les mêmes fonctionnalités que celles qui étaient déjà disponibles en utilisant les fonctions du module string. La plupart de ces nouvelles méthodes ont été largement acceptées, mais celle qui semble rendre certains programmeurs inconfortables est ::

source: which gives the result::
fr: qui donne le résultat ::

source: There are two common arguments against this usage.
fr: Il y a deux arguments fréquents contre cet usage.

source: The first runs along the lines of: "It looks really ugly using a method of a string literal (string constant)", to which the answer is that it might, but a string literal is just a fixed value. If the methods are to be allowed on names bound to strings there is no logical reason to make them unavailable on literals.
fr: Le premier se caractérise par les lignes suivantes : "C'est vraiment moche d'utiliser une méthode de chaîne littérale (chaîne constante)", à laquelle la réponse est qu'il se peut, mais une chaîne littérale est juste une valeur fixe. Si la méthode est autorisée sur des noms liés à des chaînes, il n'y a pas de raison logique à les rendre indisponibles sur des chaînes littérales.

source: The second objection is typically cast as: "I am really telling a sequence to join its members together with a string constant". Sadly, you aren't. For some reason there seems to be much less difficulty with having :meth:`~str.split` as a string method, since in that case it is easy to see that ::
fr: La deuxième objection se réfère typiquement à : "Je suis réellement en train de dire à une séquence de joindre ses membres avec une constante de chaîne". Malheureusement, vous ne l'êtes pas. Pour quelque raison, il semble être bien moins difficile d'avoir :meth:`~str.split` en tant que méthode de chaîne, puisque dans ce cas il est facile de voir que ::

source: is an instruction to a string literal to return the substrings delimited by the given separator (or, by default, arbitrary runs of white space).
fr: est une instruction à une chaîne littérale de retourner les sous-chaînes délimitées par le séparateur fournit (ou, par défaut, les espaces).
